stevenj/avr-libc3/include/avr/io/atmega48a.h
/* PORTB - I/O Port (0x0000) */
#define PORTBB_BASE      _SFR_MEM8 (0x0000) /* PORTBB Base Address */
#define PORTBB_PINB      _SFR_MEM8 (0x0023) /* Port B Input Pins */
#define PORTBB_DDRB      _SFR_MEM8 (0x0024) /* Port B Data Direction Register */
#define PORTBB_PORTB     _SFR_MEM8 (0x0025) /* Port B Data Register */

/* PORTC - I/O Port (0x0000) */
#define PORTCC_BASE      _SFR_MEM8 (0x0000) /* PORTCC Base Address */
#define PORTCC_PINC      _SFR_MEM8 (0x0026) /* Port C Input Pins */
#define PORTCC_DDRC      _SFR_MEM8 (0x0027) /* Port C Data Direction Register */
#define PORTCC_PORTC     _SFR_MEM8 (0x0028) /* Port C Data Register */

/* PORTD - I/O Port (0x0000) */
#define PORTDD_BASE      _SFR_MEM8 (0x0000) /* PORTDD Base Address */
#define PORTDD_PIND      _SFR_MEM8 (0x0029) /* Port D Input Pins */
#define PORTDD_DDRD      _SFR_MEM8 (0x002A) /* Port D Data Direction Register */
#define PORTDD_PORTD     _SFR_MEM8 (0x002B) /* Port D Data Register */

/* TC0 - Timer/Counter, 8-bit (0x0000) */
#define TC8_BASE         _SFR_MEM8 (0x0000) /* TC8 Base Address */
#define TC8_TIFR0        _SFR_MEM8 (0x0035) /* Timer/Counter0 Interrupt Flag register */
#define TC8_GTCCR        _SFR_MEM8 (0x0043) /* General Timer/Counter Control Register */
#define TC8_TCCR0A       _SFR_MEM8 (0x0044) /* Timer/Counter  Control Register A */
#define TC8_TCCR0B       _SFR_MEM8 (0x0045) /* Timer/Counter Control Register B */
#define TC8_TCNT0        _SFR_MEM8 (0x0046) /* Timer/Counter0 */
#define TC8_OCR0A        _SFR_MEM8 (0x0047) /* Timer/Counter0 Output Compare Register */
#define TC8_OCR0B        _SFR_MEM8 (0x0048) /* Timer/Counter0 Output Compare Register */
#define TC8_TIMSK0       _SFR_MEM8 (0x006E) /* Timer/Counter0 Interrupt Mask Register */

/* EXINT - External Interrupts (0x0000) */
#define EXINT_BASE       _SFR_MEM8 (0x0000) /* EXINT Base Address */
#define EXINT_PCIFR      _SFR_MEM8 (0x003B) /* Pin Change Interrupt Flag Register */
#define EXINT_EIFR       _SFR_MEM8 (0x003C) /* External Interrupt Flag Register */
#define EXINT_EIMSK      _SFR_MEM8 (0x003D) /* External Interrupt Mask Register */
#define EXINT_PCICR      _SFR_MEM8 (0x0068) /* Pin Change Interrupt Control Register */
#define EXINT_EICRA      _SFR_MEM8 (0x0069) /* External Interrupt Control Register */
#define EXINT_PCMSK0     _SFR_MEM8 (0x006B) /* Pin Change Mask Register 0 */
#define EXINT_PCMSK1     _SFR_MEM8 (0x006C) /* Pin Change Mask Register 1 */
#define EXINT_PCMSK2     _SFR_MEM8 (0x006D) /* Pin Change Mask Register 2 */

/* SPI - Serial Peripheral Interface (0x0000) */
#define SPI_BASE         _SFR_MEM8 (0x0000) /* SPI Base Address */
#define SPI_SPCR         _SFR_MEM8 (0x004C) /* SPI Control Register */
#define SPI_SPSR         _SFR_MEM8 (0x004D) /* SPI Status Register */
#define SPI_SPDR         _SFR_MEM8 (0x004E) /* SPI Data Register */

/* WDT - Watchdog Timer (0x0000) */
#define WDT_BASE         _SFR_MEM8 (0x0000) /* WDT Base Address */
#define WDT_WDTCSR       _SFR_MEM8 (0x0060) /* Watchdog Timer Control Register */

/* EEPROM - EEPROM (0x0000) */
#define EEPROM_BASE      _SFR_MEM8 (0x0000) /* EEPROM Base Address */
#define EEPROM_EECR      _SFR_MEM8 (0x003F) /* EEPROM Control Register */
#define EEPROM_EEDR      _SFR_MEM8 (0x0040) /* EEPROM Data Register */
#define EEPROM_EEARL     _SFR_MEM8 (0x0041) /* EEPROM Address Register Low Byte */
#define EEPROM_EEARH     _SFR_MEM8 (0x0042) /* EEPROM Address Register High Byte */

/* CPU - CPU Registers (0x0000) */
#define CPU_BASE         _SFR_MEM8 (0x0000) /* CPU Base Address */
#define CPU_GPIOR0       _SFR_MEM8 (0x003E) /* General Purpose I/O Register 0 */
#define CPU_GPIOR1       _SFR_MEM8 (0x004A) /* General Purpose I/O Register 1 */
#define CPU_GPIOR2       _SFR_MEM8 (0x004B) /* General Purpose I/O Register 2 */
#define CPU_SMCR         _SFR_MEM8 (0x0053) /* Sleep Mode Control Register */
#define CPU_MCUSR        _SFR_MEM8 (0x0054) /* MCU Status Register */
#define CPU_MCUCR        _SFR_MEM8 (0x0055) /* MCU Control Register */
#define CPU_SPMCSR       _SFR_MEM8 (0x0057) /* Store Program Memory Control and Status Register */
#define CPU_SP           _SFR_MEM16(0x005D) /* Stack Pointer  */
#define CPU_SPL          _SFR_MEM8 (0x005D) /* Stack Pointer  LOW BYTE */
#define CPU_SPH          _SFR_MEM8 (0x005E) /* Stack Pointer  HIGH BYTE */
#define CPU_SREG         _SFR_MEM8 (0x005F) /* Status Register */
#define CPU_CLKPR        _SFR_MEM8 (0x0061) /* Clock Prescale Register */
#define CPU_PRR          _SFR_MEM8 (0x0064) /* Power Reduction Register */
#define CPU_OSCCAL       _SFR_MEM8 (0x0066) /* Oscillator Calibration Value */

/* FUSE - Fuses (0x0000) */
#define FUSE_BASE        _SFR_MEM8 (0x0000) /* FUSE Base Address */
#define FUSE_LOW         _SFR_MEM8 (0x0000) 
#define FUSE_HIGH        _SFR_MEM8 (0x0001) 
#define FUSE_EXTENDED    _SFR_MEM8 (0x0002) 

/* LOCKBIT - Lockbits (0x0000) */
#define LOCKBIT_BASE     _SFR_MEM8 (0x0000) /* LOCKBIT Base Address */
#define LOCKBIT_LOCKBIT  _SFR_MEM8 (0x0000) 
/* avr-libc typedef for avr/fuse.h */
typedef FUSE_t NVM_FUSES_t;

/*
================================================================================
Interrupt Vector Definitions
================================================================================
*/

/* Vector 0 is the reset vector */
#define None_RESET_vect_num        (0)                 
#define None_RESET_vect            _VECTOR(0)          /* External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset */
#define None_INT0_vect_num         (1)                 
#define None_INT0_vect             _VECTOR(1)          /* External Interrupt Request 0 */
#define None_INT1_vect_num         (2)                 
#define None_INT1_vect             _VECTOR(2)          /* External Interrupt Request 1 */
#define None_PCINT0_vect_num       (3)                 
#define None_PCINT0_vect           _VECTOR(3)          /* Pin Change Interrupt Request 0 */
#define None_PCINT1_vect_num       (4)                 
#define None_PCINT1_vect           _VECTOR(4)          /* Pin Change Interrupt Request 0 */
#define None_PCINT2_vect_num       (5)                 
#define None_PCINT2_vect           _VECTOR(5)          /* Pin Change Interrupt Request 1 */
#define None_WDT_vect_num          (6)                 
#define None_WDT_vect              _VECTOR(6)          /* Watchdog Time-out Interrupt */
#define None_TIMER2_COMPA_vect_num (7)                 
#define None_TIMER2_COMPA_vect     _VECTOR(7)          /* Timer/Counter2 Compare Match A */
#define None_TIMER2_COMPB_vect_num (8)                 
#define None_TIMER2_COMPB_vect     _VECTOR(8)          /* Timer/Counter2 Compare Match A */
#define None_TIMER2_OVF_vect_num   (9)                 
#define None_TIMER2_OVF_vect       _VECTOR(9)          /* Timer/Counter2 Overflow */
#define None_TIMER1_CAPT_vect_num  (10)                
#define None_TIMER1_CAPT_vect      _VECTOR(10)         /* Timer/Counter1 Capture Event */
#define None_TIMER1_COMPA_vect_num (11)                
#define None_TIMER1_COMPA_vect     _VECTOR(11)         /* Timer/Counter1 Compare Match A */
#define None_TIMER1_COMPB_vect_num (12)                
#define None_TIMER1_COMPB_vect     _VECTOR(12)         /* Timer/Counter1 Compare Match B */
#define None_TIMER1_OVF_vect_num   (13)                
#define None_TIMER1_OVF_vect       _VECTOR(13)         /* Timer/Counter1 Overflow */
#define None_TIMER0_COMPA_vect_num (14)                
#define None_TIMER0_COMPA_vect     _VECTOR(14)         /* TimerCounter0 Compare Match A */
#define None_TIMER0_COMPB_vect_num (15)                
#define None_TIMER0_COMPB_vect     _VECTOR(15)         /* TimerCounter0 Compare Match B */
#define None_TIMER0_OVF_vect_num   (16)                
#define None_TIMER0_OVF_vect       _VECTOR(16)         /* Timer/Couner0 Overflow */
#define None_SPI_STC_vect_num      (17)                
#define None_SPI_STC_vect          _VECTOR(17)         /* SPI Serial Transfer Complete */
#define None_USART_RX_vect_num     (18)                
#define None_USART_RX_vect         _VECTOR(18)         /* USART Rx Complete */
#define None_USART_UDRE_vect_num   (19)                
#define None_USART_UDRE_vect       _VECTOR(19)         /* USART, Data Register Empty */
#define None_USART_TX_vect_num     (20)                
#define None_USART_TX_vect         _VECTOR(20)         /* USART Tx Complete */
#define None_ADC_vect_num          (21)                
#define None_ADC_vect              _VECTOR(21)         /* ADC Conversion Complete */
#define None_EE_READY_vect_num     (22)                
#define None_EE_READY_vect         _VECTOR(22)         /* EEPROM Ready */
#define None_ANALOG_COMP_vect_num  (23)                
#define None_ANALOG_COMP_vect      _VECTOR(23)         /* Analog Comparator */
#define None_TWI_vect_num          (24)                
#define None_TWI_vect              _VECTOR(24)         /* Two-wire Serial Interface */
#define None_SPM_Ready_vect_num    (25)                
#define None_SPM_Ready_vect        _VECTOR(25)         /* Store Program Memory Read */

/* Vector Table Size */
#define _VECTOR_SIZE               (2)                 /* Size of individual vector. */
#define _VECTORS_SIZE              (26 * _VECTOR_SIZE) /* Size of all vectors */
/*
================================================================================
Constants
================================================================================
*/

#define PROGMEM_START   (0x0000)                           
#define PROGMEM_SIZE    (0x1000)                           
#define PROGMEM_END     (PROGMEM_START + PROGMEM_SIZE - 1) 

